test/channel/0.orig/sigma

/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      sigma;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

sigma 0;
dimensions      [-1 -3 3 0 0 2 0];

internalField   uniform 0;

boundaryField
{   
    //note: this boundary conditions aren't actually used because the sigma on the
    //various patches is internally calculated and updated by the sigmaClass
    
    inlet
    {
        type            cyclic;
    }

    outlet
    {
        type            cyclic;
    }

    symm
    {
        type            symmetry;
    }

    wall
    {
        type            zeroGradient;
    }
    
    //#includeEtc "caseDicts/setConstraintTypes"
}

// ************************************************************************* //
