test/channel/system/calcB
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Version:  v2206
    \\  /    A nd           | Website:  www.openfoam.com
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Calculates the vorticity field, i.e. the curl of the velocity field.

\*---------------------------------------------------------------------------*/

type            vorticity;
libs            (fieldFunctionObjects);

field           A;

executeControl  writeTime;
writeControl    writeTime;

// ************************************************************************* //
