test/channel/system/extrudeMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      extrudeMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// What to extrude:
//      patch   : from patch of another case ('sourceCase')
//      mesh    : as above but with original case included
//      surface : from externally read surface

//constructFrom mesh;
constructFrom patch;
//constructFrom surface;

// If construct from patch/mesh:
sourceCase      ".";
// and one of sourcePatches or sourceFaceZones (but not both):
//sourceFaceZones (someFacesZone);
sourcePatches   (front);

// If construct from patch: patch to use for back (can be same as sourcePatch)
exposedPatchName back;

// Flip surface normals before usage. Valid only for extrude from surface or
// patch.
flipNormals true;

//- Wedge extrusion of a single layer
//  with wedge patches on front and back
extrudeModel        wedge;

nLayers             1;

//expansionRatio      1.0;

sectorCoeffs    //<- Also used for wedge
{
    //point       (0 0 0);
    axisPt       (0 0 0);
    axis        (0 0 1);
    angle       5;  // For nLayers=1 assume symmetry so angle/2 on each side
}

// Do front and back need to be merged? Usually only makes sense for 360
// degree wedges.
mergeFaces false;

// Merge small edges. Fraction of bounding box.
mergeTol 1e-13;


// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
